# Assignment: datacleaning pandas

# Name: Kumar R

Import pandas and numpy libraries to perform the given task.

In [1]:
import pandas as pd
import numpy as np

Loading the data as df.

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

Checking the information of the data df using info()

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   From_To       5 non-null      object
 1   FlightNumber  3 non-null      float64
 2   RecentDelays  5 non-null      object
 3   Airline       5 non-null      object
dtypes: float64(1), object(3)
memory usage: 288.0+ bytes

The data table df contains total 4 columns of data type "object" except FlightNumber ("float"). Column "FlightNumber" has 2 missing values.

Step-1. Fill in the missing numbers and make the column "FlightNumber" an integer column
(instead of a float column).

In [5]:
df['FlightNumber'].isnull()

0    False
1     True
2    False
3     True
4    False
Name: FlightNumber, dtype: bool

Get the index of the missing values in the column "FlightNumber".

In [6]:
df[df['FlightNumber'].isnull()].index

Int64Index([1, 3], dtype='int64')

In [7]:
x=np.where(df['FlightNumber'].isnull() == True)
x

(array([1, 3], dtype=int64),)

Array index 1 and 3 has missing values. These two missing values are filled with 10055 and 10075.

In [8]:
df['FlightNumber'][1] = 10055

<ipython-input-8-dfe4ef6c9cde>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['FlightNumber'][1] = 10055

In [9]:
df['FlightNumber'][3] = 10075

<ipython-input-9-dd209c9e7137>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['FlightNumber'][3] = 10075

In [10]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

Typecasting the column "FlightNumber" from float to int.

In [11]:
df['FlightNumber']=df['FlightNumber'].astype(int)

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   From_To       5 non-null      object
 1   FlightNumber  5 non-null      int32
 2   RecentDelays  5 non-null      object
 3   Airline       5 non-null      object
dtypes: int32(1), object(3)
memory usage: 268.0+ bytes

In [13]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

Step-2. Splitting the "From_To" into two seperate columns ['From' and 'To'].

In [14]:
df['From_To']

0        LoNDon_paris
1        MAdrid_miLAN
2    londON_StockhOlm
3      Budapest_PaRis
4     Brussels_londOn
Name: From_To, dtype: object

In [15]:
df_Temporary = pd.DataFrame(df['From_To'].str.split('_').tolist(), columns=["From", "To"])

In [16]:
df_Temporary

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

Step-3. Capitalisation of the city names is all mixed yp in this df_Temporary DataFrame. Standardising the strings in such a way that only the first letter is in uppercase and rest others are in lowercase.

In [17]:
from1 = [j.title() for j in df_Temporary['From']]
to1 = [i.title() for i in df_Temporary['To']]
df_Temporary['From'] = from1
df_Temporary['To'] = to1
df_Temporary

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

Step-4. Delete the "From_To" column from df and attach the df_Temporary DataFrame
from the step-3.

In [18]:
df.drop('From_To', axis=1, inplace=True)

In [20]:
df = pd.concat([df_Temporary, df], axis=1)

In [21]:
df

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []    <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris         10075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]          "Swiss Air"

Step-5. In the "RecentDelays" column, we are splitting the list of values into different columns with uniqe names.

In [22]:
df[['a','b','c']] = pd.DataFrame(df['RecentDelays'].to_list(), index=df.index)
df

,From,To,FlightNumber,RecentDelays,Airline,a,b,c
0,London,Paris,10045,"[23, 47]",KLM(!),23.0,47.0,NaN
1,Madrid,Milan,10055,[],<Air France> (12),NaN,NaN,NaN
2,London,Stockholm,10065,"[24, 43, 87]",(British Airways. ),24.0,43.0,87.0
3,Budapest,Paris,10075,[13],12. Air France,13.0,NaN,NaN
4,Brussels,London,10085,"[67, 32]","""Swiss Air""",67.0,32.0,NaN

Renaming the column names [a,b,c] with [Delay_1, Delay_2, Delay_3] respectively.

In [23]:
df.rename({'a':'Delay_1','b':'Delay_2','c':'Delay_3'}, axis=1)
df

,From,To,FlightNumber,RecentDelays,Airline,a,b,c
0,London,Paris,10045,"[23, 47]",KLM(!),23.0,47.0,NaN
1,Madrid,Milan,10055,[],<Air France> (12),NaN,NaN,NaN
2,London,Stockholm,10065,"[24, 43, 87]",(British Airways. ),24.0,43.0,87.0
3,Budapest,Paris,10075,[13],12. Air France,13.0,NaN,NaN
4,Brussels,London,10085,"[67, 32]","""Swiss Air""",67.0,32.0,NaN

Deleting the unwanted column "RecentDelays" from the DataFrame df.

In [24]:
df.drop('RecentDelays', axis=1, inplace=True)

In [25]:
df

       From         To  FlightNumber              Airline     a     b     c
0    London      Paris         10045               KLM(!)  23.0  47.0   NaN
1    Madrid      Milan         10055    <Air France> (12)   NaN   NaN   NaN
2    London  Stockholm         10065  (British Airways. )  24.0  43.0  87.0
3  Budapest      Paris         10075       12. Air France  13.0   NaN   NaN
4  Brussels     London         10085          "Swiss Air"  67.0  32.0   NaN